content/neovim/configs/plugins/01-treesitter.org
#+TITLE: Neovim Treesitter Configuration
#+AUTHOR: Kyeong Soo Choi
#+DATE: 2025-12-01
#+PROPERTY: header-args:lua :tangle ~/.config/nvim/lua/pengling/plugins/treesitter.lua :mkdirp yes

* Overview

Treesitter provides advanced syntax highlighting, indentation, and text objects based on tree-sitter parsers.

* Configuration

#+begin_src lua
  require("nvim-treesitter.configs").setup({
    ensure_installed = {
      "awk",
      "c",
      "clojure",
      "css",
      "csv",
      "desktop",
      "diff",
      "dockerfile",
      "git_config",
      "gitcommit",
      "gitignore",
      "go",
      "html",
      "htmldjango",
      "http",
      "ini",
      "java",
      "javascript",
      "jinja_inline",
      "jinja",
      "jq",
      "json",
      "kdl",
      "lua",
      "make",
      "markdown_inline",
      "markdown",
      "nginx",
      "perl",
      "python",
      "query",
      "ruby",
      "rust",
      "scheme",
      "sql",
      "ssh_config",
      "tmux",
      "toml",
      "tsv",
      "tsx",
      "typescript",
      "vim",
      "vim",
      "vimdoc",
      "xml",
      "yaml",
    },
    sync_install = false,
    auto_install = false,
    highlight = {
      enable = true,
      disable = function(_, buf)
        local max_filesize = 100 * 1024 -- 100 KB
        local ok, stats = pcall(vim.loop.fs_stat, vim.api.nvim_buf_get_name(buf))
        if ok and stats and stats.size > max_filesize then
          return true
        end
      end,
      additional_vim_regex_highlighting = false,
    },
    indent = {
      enable = true,
    },
    textobjects = {
      select = {
        enable = true,
        lookahead = true,             -- automatically jump forward to textobj
        keymaps = {
          ["af"] = "@function.outer", -- around function
          ["if"] = "@function.inner", -- inside function
          ["ac"] = "@class.outer",
          ["ic"] = "@class.inner",
        },
      },
    },
  })
#+end_src

* Features Explained

** Ensure Installed
A comprehensive list of tree-sitter parsers to be installed, covering:
- Programming languages (C, Python, Ruby, Rust, Go, Java)
- Web technologies (HTML, CSS, JavaScript, TypeScript)
- Configuration formats (YAML, TOML, JSON, INI)
- Documentation formats (Markdown, Vimdoc)
- Version control (Git commit, Git config, Gitignore)
- Infrastructure (Dockerfile, Nginx, SSH config)

** Highlight Configuration
- Enabled by default for syntax highlighting
- Automatically disabled for large files (>100KB) to prevent performance issues
- No additional vim regex highlighting (using pure treesitter)

** Indentation
Treesitter-based indentation is enabled for more accurate auto-indenting.

** Text Objects
Custom text objects for better code navigation:
- =af= - Around function
- =if= - Inside function  
- =ac= - Around class
- =ic= - Inside class

With =lookahead= enabled, the cursor will automatically jump forward to find the text object.
