neovim/configs/plugins/01-treesitter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Neovim Treesitter Configuration</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/style.css"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="content">
<h1 class="title">Neovim Treesitter Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgabb3453">1. Overview</a></li>
<li><a href="#org05e58e7">2. Configuration</a></li>
<li><a href="#org3ee7445">3. Features Explained</a>
<ul>
<li><a href="#org174c91f">3.1. Ensure Installed</a></li>
<li><a href="#org67289ac">3.2. Highlight Configuration</a></li>
<li><a href="#org6d2de0a">3.3. Indentation</a></li>
<li><a href="#org4b9e2cf">3.4. Text Objects</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgabb3453" class="outline-2">
<h2 id="orgabb3453"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
Treesitter provides advanced syntax highlighting, indentation, and text objects based on tree-sitter parsers.
</p>
</div>
</div>

<div id="outline-container-org05e58e7" class="outline-2">
<h2 id="org05e58e7"><span class="section-number-2">2.</span> Configuration</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-lua">require("nvim-treesitter.configs").setup({
  ensure_installed = {
    "awk",
    "c",
    "clojure",
    "css",
    "csv",
    "desktop",
    "diff",
    "dockerfile",
    "git_config",
    "gitcommit",
    "gitignore",
    "go",
    "html",
    "htmldjango",
    "http",
    "ini",
    "java",
    "javascript",
    "jinja_inline",
    "jinja",
    "jq",
    "json",
    "kdl",
    "lua",
    "make",
    "markdown_inline",
    "markdown",
    "nginx",
    "perl",
    "python",
    "query",
    "ruby",
    "rust",
    "scheme",
    "sql",
    "ssh_config",
    "tmux",
    "toml",
    "tsv",
    "tsx",
    "typescript",
    "vim",
    "vim",
    "vimdoc",
    "xml",
    "yaml",
  },
  sync_install = false,
  auto_install = false,
  highlight = {
    enable = true,
    disable = function(_, buf)
      local max_filesize = 100 * 1024 -- 100 KB
      local ok, stats = pcall(vim.loop.fs_stat, vim.api.nvim_buf_get_name(buf))
      if ok and stats and stats.size &gt; max_filesize then
        return true
      end
    end,
    additional_vim_regex_highlighting = false,
  },
  indent = {
    enable = true,
  },
  textobjects = {
    select = {
      enable = true,
      lookahead = true,             -- automatically jump forward to textobj
      keymaps = {
        ["af"] = "@function.outer", -- around function
        ["if"] = "@function.inner", -- inside function
        ["ac"] = "@class.outer",
        ["ic"] = "@class.inner",
      },
    },
  },
})
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ee7445" class="outline-2">
<h2 id="org3ee7445"><span class="section-number-2">3.</span> Features Explained</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org174c91f" class="outline-3">
<h3 id="org174c91f"><span class="section-number-3">3.1.</span> Ensure Installed</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A comprehensive list of tree-sitter parsers to be installed, covering:
</p>
<ul class="org-ul">
<li>Programming languages (C, Python, Ruby, Rust, Go, Java)</li>
<li>Web technologies (HTML, CSS, JavaScript, TypeScript)</li>
<li>Configuration formats (YAML, TOML, JSON, INI)</li>
<li>Documentation formats (Markdown, Vimdoc)</li>
<li>Version control (Git commit, Git config, Gitignore)</li>
<li>Infrastructure (Dockerfile, Nginx, SSH config)</li>
</ul>
</div>
</div>

<div id="outline-container-org67289ac" class="outline-3">
<h3 id="org67289ac"><span class="section-number-3">3.2.</span> Highlight Configuration</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Enabled by default for syntax highlighting</li>
<li>Automatically disabled for large files (&gt;100KB) to prevent performance issues</li>
<li>No additional vim regex highlighting (using pure treesitter)</li>
</ul>
</div>
</div>

<div id="outline-container-org6d2de0a" class="outline-3">
<h3 id="org6d2de0a"><span class="section-number-3">3.3.</span> Indentation</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Treesitter-based indentation is enabled for more accurate auto-indenting.
</p>
</div>
</div>

<div id="outline-container-org4b9e2cf" class="outline-3">
<h3 id="org4b9e2cf"><span class="section-number-3">3.4.</span> Text Objects</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Custom text objects for better code navigation:
</p>
<ul class="org-ul">
<li><code>af</code> - Around function</li>
<li><code>if</code> - Inside function</li>
<li><code>ac</code> - Around class</li>
<li><code>ic</code> - Inside class</li>
</ul>

<p>
With <code>lookahead</code> enabled, the cursor will automatically jump forward to find the text object.
</p>
</div>
</div>
</div>
</main>
<footer id="postamble" class="status">
<p class="date">Date: 2025-12-01</p>
</footer>
</body>
</html>
